editors/emacs.d/dotemacs.org
#+title: DotEmacs with Org Mode
#+property: header-args :tangle "~/dotz/editors/emacs.d/init.el"

* About this document

This is my emacs configuration. It's heavily inspired by many different =init.el= files.

#+BEGIN_SRC emacs-lisp
;;; init.el --- Emacs main configuration file -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t; coding: utf-8-*-
;;;
;;; Commentary:
;;; Emacs config by dylanjm
;;; Do not change this file.  Main config is located in emacs.d/dotemacs.org
;;;
;;; Code:
#+END_SRC

* Initial Setup with =early-init.el=
:properties:
:header-args: :tangle "~/dotz/editors/emacs.d/early-init.el"
:end:

This section details the =early-init.el= section of the configuration.

** Header
#+BEGIN_SRC emacs-lisp
;;; early-init.el --- Early initialization. -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t-*-
;;;
;;; Commentary:
;;; Emacs config by dylanjm
;;; This file was automatically generated by `org-babel-tangle'.
;;; Do not change this file.  Main config is located in emacs.d/dotemacs.org
;;;
;;; Code:
#+END_SRC

** Rolling my own =no-littering.el=
I didn't really the like the =no-littering= package when I gave it a try. So I'm
going to roll my own for the time being by declaring these variables. Maybe I'll
come pack to the package later but for right now this works for me. I got the
idea for this function from jwiegley's dot-files. You can find his version of
the function in his github repo [[https://github.com/jwiegley/dot-emacs/blob/master/init.el][jwiegley/dot-emacs/init.el]].

#+BEGIN_SRC emacs-lisp
(defvar user-emacs-cache "~/.cache/emacs/")

(eval-and-compile
  (defun djm/emacs-path (path)
    (expand-file-name path user-emacs-directory)))

(eval-and-compile
    (defun djm/emacs-cache (path)
           (expand-file-name path user-emacs-cache)))
#+END_SRC

** Performance enhancements
You'll see the following code in many =init.el= files across the web. This has
to do with the performance hit emacs takes while performing garbage collection.
There are a few caveats though:

1. If you set =gc-cons-threshold= too high, and don't change it back, Emacs will
   start to freeze and lag during memory intensive operations.
2. If you keep it too low, then emacs will also start lag as it will be running
   the garbage collector too often.

You may have to play with these values depending on the specs of your computer.
Not only do we want to suspend garbage collection on start-up, but we can
implement a few tricks (or hacks) such that the garbage collector is run at
optimal times. I got this idea from seagle0128's widely-popular centaur emacs.
You can see how he implemented this at [[https://github.com/seagle0128/.emacs.d/blob/master/init.el][seagle0128/.emacs.d/init.el]].

TODO: Detail why we left out a few popular variables to set based on some /r/emacs posts.

#+BEGIN_SRC emacs-lisp
  (defvar default-file-name-handler-alist file-name-handler-alist)
  (defvar default-gc-cons-threshold (if (display-graphic-p) 800000 800000))
  (defvar extended-gc-cons-threshold (if (display-graphic-p) 400000000 100000000))

  (setq-default  inhibit-compacting-font-caches t
                 frame-inhibit-implied-resize t
                 gc-cons-percentage 0.6
                 auto-window-vscroll nil
                 file-name-handler-alist nil)

  (add-hook 'after-init-hook
            (lambda ()
              (setq file-name-handler-alist default-file-name-handler-alist)
              (setq gc-cons-threshold default-gc-cons-threshold)
              (setq gc-cons-percentage 0.1)

              (defun djm/gc-on-lose-focus ()
                (unless (frame-focus-state)
                  (garbage-collect)))

              (if (boundp 'after-focus-change-function)
                  (add-function :after after-focus-change-function #'djm/gc-on-lose-focus))

              (defun djm/minibuffer-setup-hook ()
                (setq gc-cons-threshold extended-gc-cons-threshold))

              (defun djm/minibuffer-exit-hook ()
                (setq gc-cons-threshold default-gc-cons-threshold))

              (add-hook 'minibuffer-setup-hook #'djm/minibuffer-setup-hook)
              (add-hook 'minibuffer-exit-hook #'djm/minibuffer-exit-hook)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)
(fset 'view-hello-file 'ignore)
(fset 'display-startup-echo-area-message 'ignore)
(put 'narrow-to-region 'disabled nil)
(put 'up-case-rgion 'disabled nil)
(put 'downcase-region 'disabled nil)
(put 'erase-buffer 'disabled nil)

(push '(ns-transparent-titlebar . t) default-frame-alist)
(push '(internal-border . 0) default-frame-alist)
(push '(tool-bar-lines . 0) default-frame-alist)
(push '(vertical-scroll-bars) default-frame-alist)
(push '(font . "-*-Iosevka Nerd Font Mono-ultralight-normal-normal-*-18-*-*-*-m-0-iso10646-1") default-frame-alist)
(push '(variable-pitch . "-*-Fira Sans-light-normal-normal-*-18-*-*-*-p-0-iso10646-1") default-frame-alist)
#+END_SRC

** Getting packages /straightened-out/ using =straight.el=

#+BEGIN_SRC emacs-lisp
(setq straight-check-for-modifications '(find-when-checking check-on-save)
      use-package-enable-imenu-support t
      straight-use-package-by-default t)

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)

(use-package use-package-chords)
(use-package use-package-ensure-system-package)
(use-package use-package-hydra)

(provide 'early-init)
;;; early-init.el ends here
#+END_SRC

This concludes =early-init.el=.

* Default Settings
** Sane settings for the insane
#+begin_src emacs-lisp
  (use-package cus-start
    :straight nil
    :custom
    (ad-redefinition-action 'accept)
    (auto-save-list-file-prefix nil)
    (auto-window-vscroll nil)
    (backup-by-copying t)
    (browse-urls-browser-function "firefox")
    (confirm-kill-processes nil)
    (create-lockfiles nil)
    (cursor-in-non-selected-windows nil)
    (cursor-type 'bar)
    (custom-file (make-temp-file "emacs-custom"))
    (debug-on-error t)
    (display-time-default-load-average nil)
    (echo-keystrokes 0.02)
    (enable-recursive-minibuffers t)
    (eval-expression-print-length nil)
    (eval-expression-print-level nil)
    (fill-column 80)
    (frame-inhibit-implied-resize t)
    (fast-but-imprecise-scrolling t)
    (ffap-machine-p-known 'reject)
    (frame-resize-pixelwise t)
    (frame-title-format '("%b - Emacs"))
    (help-window-select t)
    (icon-title-format frame-title-format)
    (indent-tabs-mode nil)
    (inhibit-compacting-font-caches t)
    (inhibit-default-init t)
    (inhibit-startup-screen t)
    (inhibit-startup-echo-area-message t)
    (initial-scratch-message "")
    (insert-directory-program "gls")
    (line-spacing 1)
    (load-prefer-newer t)
    (message-log-max 10000)
    (mode-line-in-non-selected-windows nil)
    (mouse-wheel-progressive-speed nil)
    (mouse-wheel-scroll-amount '(1))
    (ns-use-thin-smoothing t)
    (ring-bell-function #'ignore)
    (set-horizontal-scroll-bar-mode nil)
    (scroll-conservatively most-positive-fixnum)
    (scroll-margin 5)
    (scroll-preserve-screen-position t)
    (scroll-step 1)
    (select-enable-clipboard t)
    (sentence-end-double-space nil)
    (tab-always-indent 'complete)
    (tab-width 4)
    (transient-history-file (djm/emacs-cache "transient/history.el"))
    (transient-levels-file (djm/emacs-cache "transient/levels.el"))
    (transient-values-file (djm/emacs-cache "transient/values.el"))
    (uniquify-buffer-name-style 'post-forward-angle-brackets)
    (use-dialog-box nil)
    (use-file-dialog nil)
    (vc-follow-symlinks t)
    (view-read-only t)
    (window-combination-resize t)
    :config
    (prefer-coding-system 'utf-8-unix)
    (set-language-environment "UTF-8")
    (global-hl-line-mode 1)
    (blink-cursor-mode 0))

  (use-package osx-trash :init (osx-trash-setup))
#+end_src

** Auto-Save Madness

#+begin_src emacs-lisp
  (use-package files
    :straight nil
    :custom
    (auto-save-file-name-transforms `((".*" ,(djm/emacs-cache "backups/") t)))
    (backup-directory-alist `(("." . ,(djm/emacs-cache "backups/")))))
#+end_src

