editors/emacs.d/init.el

(use-package frame
    :straight nil
    :config (window-divider-mode 1)
    :custom
    (window-divider-default-places t)
    (window-divider-default-bottom-width 1)
    (window-divider-default-right-width 1)
    (global-unset-key (kbd "C-z")))

  (use-package simple
    :straight nil
    :custom
    (column-number-mode nil)
    (line-number-mode nil)
    (line-move-visual nil)
    (track-eol t)
    (set-mark-command-repeat-pop t))

  (use-package fringe
    :straight nil
    :custom
    (fringe-indicator-alist (delq (assq 'continuation fringe-indicator-alist)
                                  fringe-indicator-alist))
    :config (fringe-mode '(10 . 8)))

  (use-package pixel-scroll
    :demand t
    :straight nil
    :config (pixel-scroll-mode 1))

  (use-package ns-win
    :straight nil
    :custom
    (ns-pop-up-frames nil)
    (ns-use-native-fullscreen nil)
    (mac-option-modifier 'meta)
    (mac-command-modifier 'meta)
    (mac-right-command-modifier 'left)
    (mac-right-option-modifier 'none)
    (mac-function-modifier 'hyper))

  (use-package windmove
    :bind (("C-c w l" . windmove-left)
           ("C-c w r" . windmove-right)
           ("C-c w p" . windmove-up)
           ("C-c w n" . windmove-down))
    :custom (windmove-default-keybindings 'shift))

(advice-add 'help-window-display-message :override #'ignore)
