editors/emacs.d/dotemacs.org
** Picking up where we left off

#+begin_src emacs-lisp
  (use-package focus-autosave-mode :init (focus-autosave-mode))

  (use-package saveplace
    :straight nil
    :init (save-place-mode 1)
    :custom (save-place-file (djm/emacs-cache "places")))

  (use-package savehist
    :straight nil
    :init (savehist-mode 1)
    :custom
    (history-length 1000)
    (history-delete-duplicates t)
    (savehist-autosave-interval 300)
    (savehist-file (djm/emacs-cache "emacs-history"))
    (savehist-save-minibuffer-history 1))

  (use-package autorevert
    :straight nil
    :init (global-auto-revert-mode 1)
    :custom
    (auto-revert-verbose nil)
    (global-auto-revert-non-file-buffers t)
    (auto-revert-use-notify nil))

  (use-package recentf
    :straight nil
    :functions (recentf-save-list)
    :init (recentf-mode 1)
    :custom
    (recentf-save-file (djm/emacs-cache "recentf"))
    (recentf-max-saved-items 200)
    (recentf-max-menu-items 20)
    (recentf-auto-cleanup 'never)
    (recentf-exclude '("\\.?cache"
                       ".cask"
                       "url"
                       "COMMIT_EDITMSG\\'"
                       "bookmarks"
                       "NEWS"
                       "\\.\\(?:gz\\|gif\\|svg\\|png\\|jpe?g\\)$"
                       "^/tmp/"nnn
                       "^/ssh:"
                       "\\.?ido\\.last$"
                       "\\.revive$"
                       "/TAGS$"
                       "^/var/folders/.+$"
                       (lambda (file)
                         (file-in-directory-p file package-user-dir))))
    :config
    (push (expand-file-name recentf-save-file) recentf-exclude)
    (run-at-time nil (* 3 60) (lambda () (let ((save-silently t)) (recentf-save-list)))))
#+end_src

#+BEGIN_SRC emacs-lisp
    (use-package prog-mode
      :straight nil
      :hook ((prog-mode . prettify-symbols-mode)
             (prog-mode . show-paren-mode)
             (prog-mode . display-line-numbers-mode)
             (prog-mode . display-fill-column-indicator-mode))
      :custom
      (prettify-symbols-unprettify-at-point 'right-edge))

    (use-package term
      :straight nil
      :commands (ansi-term)
      :preface
      (defun config-basic-settings--shell-hl-line-off ()
        (when (bound-and-true-p hl-line-mode)
          (hl-line-mode -1)))
      :config
      (add-hook 'term-mode-hook #'config-basic-settings--shell-hl-line-off))

    (use-package vscode-icon)
    (use-package dired
      :straight nil
      :functions (dired wdired-change-to-wdired-mode)
      :bind (:map dired-mode-map
                  ("C-c C-p" . wdired-change-to-wdired-mode)
                  ("C-c C-r" . dired-rsync)
                  ("TAB" . dired-subtree-insert)
                  (";" . dired-subtree-remove)
                  (":" . dired-git-info-mode))
      :custom
      (dired-auto-revert-buffer t)
      (dired-dwim-target t)
      (dired-guess-shell-gnutar "tar")
      (dired-listing-switches "-alhF --group-directories-first -v")
      (dired-ls-F-marks-symlinks t)
      (dired-recursive-deletes 'always)
      (dired-recursive-copies 'always)
      (dired-use-ls-dired nil)
      :config
      (use-package dired-aux :straight nil)
      (use-package dired-x :straight nil)
      (use-package diredfl :init (diredfl-global-mode 1))
      (use-package dired-ranger)
      (use-package dired-git-info)
      (use-package dired-rsync)
      (use-package dired-subtree)
      (use-package fd-dired)
      (use-package dired-sidebar
        :bind ("M-\\" . dired-sidebar-toggle-sidebar)
        :custom (dired-sidebar-theme 'vscode)))

    (use-package ibuffer
      :bind (([remap list-buffers] . ibuffer))
      :hook (ibuffer-mode . hl-line-mode)
      :custom
      (ibuffer-expert t)
      (ibuffer-show-empty-filter-groups nil)
      (ibuffer-formats '((mark modified " " (mode 1 1) " " (name 25 25 :left :elide) " " filename-and-process)))
      (ibuffer-never-show-predicates (list (rx (or "*Messages*"
                                                   "*magit-"
                                                   "*git-auto-push*"
                                                   "*Backtrace*"
                                                   "*new*"
                                                   "*Org*"
                                                   "*Flycheck error messages*"
                                                   "*Help*")))))

  (use-package ibuf-ext
    :straight nil
    :hook (ibuffer-mode . ibuffer-auto-mode)
    :config
    (setq ibuffer-show-empty-filter-groups nil))

  (use-package ibuffer-projectile
    :commands (ibuffer-projectile-set-filter-groups)
    :functions (ibuffer-do-sort-by-alphabetic)
    :preface
    (defun config-ibuffer--setup-buffer ()
      (ibuffer-projectile-set-filter-groups)
      (add-to-list 'ibuffer-filter-groups '("Dired" (mode . dired-mode)))
      (add-to-list 'ibuffer-filter-groups '("Ensime" (predicate . (s-matches? "Ensime" (buffer-name)))))
      (add-to-list 'ibuffer-filter-groups '("System" (predicate . (-contains? '("*Messages*" "*scratch*") (buffer-name)))))
      (add-to-list 'ibuffer-filter-groups '("Shells" (mode . eshell-mode)))
      (unless (eq ibuffer-sorting-mode 'alphabetic)
        (ibuffer-do-sort-by-alphabetic))
      (when (bound-and-true-p page-break-lines-mode)
        (page-break-lines--update-display-tables)))
    :init
    (add-hook 'ibuffer-hook #'config-ibuffer--setup-buffer)
    :config
    (setq ibuffer-projectile-prefix ""))

    (use-package whitespace
      :straight nil
      :hook (((prog-mode text-mode conf-mode) . whitespace-mode)
             (before-save . delete-trailing-whitespace))
      :custom
      (whitespace-style '(face indentation space-after-tab space-before-tab
                               tab-mark empty trailing)))

    (use-package zop-to-char
      :bind (("M-z" . zop-to-char)
             ("M-Z" . zop-up-to-char)))

    (use-package eldoc
      :custom (eldoc-idle-delay 2))

    (use-package which-key
      :custom (which-key-idle-delay 0.5)
      :config (which-key-mode))

    (use-package helpful
      :custom
      (counsel-describe-function-function #'helpful-callable)
      (counsel-describe-variable-function #'helpful-variable)
      :bind
      ([remap describe-function] . helpful-callable)
      ([remap describe-command] . helpful-command)
      ([remap describe-variable] . helpful-variable)
      ([remap describe-key] . helpful-key))

    (use-package async
      :preface
      (progn
        (autoload 'aysnc-bytecomp-package-mode "async-bytecomp")
        (autoload 'dired-async-mode "dired-async.el" nil t))
      :config
      (progn
        (async-bytecomp-package-mode 1)
        (dired-async-mode 1)))

    (use-package exec-path-from-shell
      :custom
      (exec-path-from-shell-check-startup-files nil)
      (exec-path-from-shell-variables '("PATH" "MANPATH"))
      (exec-path-from-shell-arguments '("-l"))
      :config
      (exec-path-from-shell-initialize))
#+end_src

* Theme
** Doom-Themes
#+begin_src emacs-lisp
  (use-package doom-themes
    :demand t
    :config
    (load-theme 'doom-gruvbox t)
    (setq doom-gruvbox-brighter-comments t)
    (doom-themes-org-config)
    (dolist (face '(region hl-line secondary-selection))
      (set-face-attribute face nil :extend t))
    (with-eval-after-load 'org
      (dolist (face '(org-block
                      org-block-begin-line
                      org-block-end-line
                      org-level-1
                      org-quote))
        (set-face-attribute face nil :extend t)))
    (set-face-attribute 'font-lock-comment-face nil :family "Iosevka Slab"
                        :height 180 :weight 'bold :slant 'italic))

#+end_src

** Minions

#+begin_src emacs-lisp
  (use-package minions
    :hook (after-init . minions-mode)
    :custom
    (minions-mode-line-lighter "...")
    (minions-mode-line-delimiters '("" . "")))
#+end_src

