editors/emacs.d/dotemacs.org
** Tab Line (built-in)

#+begin_src emacs-lisp
  (use-package tab-line
    :disabled t
    :straight nil
    :custom
    (tab-line-new-tab-choice nil)
    (tab-line-separator nil)
    (tab-line-close-button-show nil)
    :init (global-tab-line-mode))

  (use-package page-break-lines
    :demand t
    :commands (global-page-break-lines-mode)
    :config
    (progn
      (setq page-break-lines-modes
            '(prog-mode
              ibuffer-mode
              text-mode
              compilation-mode
              help-mode
              org-agenda-mode))
      (global-page-break-lines-mode)))

#+end_src

* Features

#+begin_src emacs-lisp
  (use-package man)

  (use-package ace-window
    :bind (("C-x o" . ace-window)))

  (use-package aggressive-indent
    :commands (aggressive-indent-mode))

  (use-package hungry-delete
    :commands (hungy-delete-mode))

  (use-package key-chord
    :custom (key-chord-two-keys-delay 0.05)
    :init (key-chord-mode 1))

  (use-package prescient
    :custom (prescient-save-file (djm/emacs-cache "prescient-save.el"))
    :config (prescient-persist-mode))

  (use-package dimmer
    :disabled t
    :custom
    (dimmer-fraction 0.33)
    (dimmer-exclusion-regexp-list '(".*Minibuf.*"
                                    ".*which-key.*"
                                    ".*Messages.*"
                                    ".*Async.*"
                                    ".*Warnings.*"
                                    ".*LV.*"
                                    ".*Ilist.*"
                                    ".*posframe.*"
                                    ".*transient.*"))
    :config (dimmer-mode))
#+end_src

#+begin_src emacs-lisp
  (use-package smartparens
    :functions (sp-backward-delete-char))
#+end_src

#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode)
    :custom (rainbow-delimters-max-face-count 5))
#+end_src

#+begin_src emacs-lisp
  (use-package undo-tree
    :init (global-undo-tree-mode 1))
#+end_src

#+begin_src emacs-lisp
  (use-package posframe
    :custom
    (posframe-arghandler #'hemacs-posframe-arghandler)
    :config
    (defun hemacs-posframe-arghandler (posframe-buffer arg-name value)
      (let ((info '(:internal-border-width 15 :min-width 80)))
        (or (plist-get info arg-name) value))))

  (use-package which-key-posframe
    :config (which-key-posframe-mode)
    :custom (which-key-posframe-poshandler
             'posframe-poshandler-point-bottom-left-corner))
#+end_src

#+begin_src emacs-lisp
  (use-package yasnippet
    :commands (yas-reload-all)
    :hook ((term-mode . (lambda () (yas-minor-mode -1)))
           (company-mode . yas-minor-mode))
    :config
    (use-package yasnippet-snippets)
    (use-package ivy-yasnippet
      :custom (ivy-yasnippet-new-snippet yas-new-snippet-default))
    (yas-reload-all)
    (yas-global-mode 1))
#+end_src

** Autocomplete

*** Hippie-Exp

#+begin_src emacs-lisp
  (use-package hippie-exp
    :bind (([remap dabbrev-expand] . hippie-expand))
    :custom
    (hippie-expand-try-functions-list '(try-expand-dabbrev
                                        try-expand-dabbrev-all-buffers
                                        try-expand-dabbrev-from-kill
                                        try-complete-file-name-partially
                                        try-complete-file-name
                                        try-expand-all-abbrevs
                                        try-expand-list
                                        try-complete-lisp-symbol-partially
                                        try-complete-lisp-symbol)))
#+end_src

*** Company

#+begin_src emacs-lisp
    (use-package company
      :demand t
      :commands global-company-mode
      :bind (:map company-active-map
                  ("RET" . nil)
                  ([return] . nil)
                  ("TAB" . company-complete-selection)
                  ([tab] . company-complete-selection)
                  ("C-f" . company-complete-common)
                  ("C-n" . company-select-next)
                  ("C-p" . company-select-previous))
      :custom
      (company-require-match 'never)
      (company-async-timeout 5)
      (company-idle-delay 0)
      (company-minimum-prefix-length 2)
      (company-tooltip-align-annotations t)
      (company-transformers '(company-sort-by-statistics
                              company-sort-by-occurrence))
      (company-frontends '(company-preview-common-frontend
                           company-pseudo-tooltip-frontend
                           company-echo-metadata-frontend))
      (company-backends '(company-capf
                          company-files
                          company-xcode
                          company-keywords))
      :config
      (global-company-mode 1)

      (use-package company-statistics
        :init (company-statistics-mode 1)
        :custom (company-statistics-file
                 (djm/emacs-cache "company-statistics-cache.el")))
      (use-package company-math
        :init
        (add-to-list 'company-backends 'company-math-symbols-unicode)
        (add-to-list 'company-backends 'company-math-symbols-latex))
      (use-package company-flx
        :init (company-flx-mode 1))
      (use-package company-prescient
        :init (company-prescient-mode 1))
      (use-package company-lsp
        :init (setq company-lsp-cache-canidates 'auto))
      (use-package company-anaconda
        :config (add-to-list 'company-backends 'company-anaconda)))

#+end_src

