editors/emacs.d/init.el

(use-package counsel
  :hook ((after-init . ivy-mode)
         (ivy-mode . counsel-mode))

  :bind (("C-x b" . ivy-switch-buffer)
         ("C-x B" . ivy-switch-buffer-other-window)
         ("C-c C-r" . ivy-resume)
         ("C-c v p" . ivy-push-view)
         ("C-c v o" . ivy-pop-view)
         ("C-c v ." . ivy-switch-view)
         :map ivy-minibuffer-map
         ("<tab>" . ivy-alt-done)
         ("C-w" . ivy-yank-word)
         ("C-r" . ivy-previous-line)
         (:map ivy-switch-buffer-map
               ("C-x k" . ivy-switch-buffer-kill))

         (:map counsel-mode-map
               ([remap dired] . counsel-dired)
               ("M-x" . counsel-M-x)
               ("C-x C-f" . counsel-find-file)
               ("C-x C-d" . counsel-dired-jump)
               ("C-x C-l" . counsel-find-library)
               ("C-x C-r" . counsel-recentf)
               ("C-x C-v" . counsel-set-variable)
               ("C-x C-u" . counsel-unicode-char)
               ("C-x j" . counsel-mark-ring)
               ("C-c g" . counsel-grep)
               ("C-c h" . counsel-command-history)
               ("C-c j" . counsel-git)
               ("C-c j" . counsel-git-grep)
               ("C-c r" . counsel-rg)
               ("C-c z" . counsel-fzf)
               ("C-c c w" . counsel-colors-web)
               ("C-h F" . counsel-describe-face)
               ("C-h f" . counsel-describe-function)
               ("C-h v" . counsel-describe-variable))

         ("C-s" . swiper)
         ("C-c c s" . swiper-isearch)
         ("C-c c r" . swiper-isearch-backward)
         ("C-S-s" . swiper-all)
         :map swiper-map
         ("M-%" . swiper-query-replace)
         ("M-s" . swiper-isearch-toggle)
         :map isearch-mode-map
         ("M-s" . swiper-isearch-toggle))

  :custom
  (ivy-dynamic-exhibit-delay-ms 250)
  (ivy-use-selectable-prompt t)
  (ivy-format-function #'ivy-format-function-arrow)
  (ivy-height 10)
  (ivy-initial-inputs-alist nil)
  (ivy-case-fold-search-default t)
  (ivy-use-virtual-buffers t)
  (ivy-virtual-abbreviate 'abbreviate)
  (ivy-count-format "")
  (ivy-flx-limit 2000)

  :config
  (use-package ivy-hydra)
  (use-package ivy-prescient
    :custom (ivy-prescient-retain-classic-highlighting t)
    :init (ivy-prescient-mode 1))

  (use-package ivy-posframe
    :init (ivy-posframe-mode 1)
    :functions (ivy-posframe-display-at-window-bottom-left
                ivy-posframe-display-at-frame-center)
    :custom
    (ivy-posframe-border-width 20)
    (ivy-posframe-style 'frame-center)
    ;(ivy-posframe-hide-minibuffer t)
    (ivy-posframe-parameters '((alpha 100 100)))

    :config
    (push (cons #'swiper nil)
          ivy-posframe-display-functions-alist)
    (push (cons t #'ivy-posframe-display-at-frame-center)
          ivy-posframe-display-functions-alist))

  (use-package counsel-projectile
    :after (counsel projectile)
    :custom
    (counsel-projectile-switch-project-action #'dired)
    :config (counsel-projectile-mode 1))

  (use-package auto-insert
    :straight nil
    :bind (("C-c ci a" . auto-insert)))

  (use-package amx
    :init (amx-mode 1)
    :custom (amx-save-file (djm/emacs-cache "amx-items")))

  (use-package flx)

  (when (executable-find "rg")
    (setq counsel-grep-base-command
          "rg -S --no-heading --line-number --color never '%s' %s"))

  (with-eval-after-load 'ivy
    (push (cons #'swiper (cdr (assq t ivy-re-builders-alist)))
          ivy-re-builders-alist)
    (push (cons #'swiper-isearch (cdr (assq t ivy-re-builders-alist)))
          ivy-re-builders-alist)
    (push (cons #'counsel-M-x #'ivy--regex-fuzzy) ivy-re-builders-alist)
    (push (cons t #'ivy--regex-fuzzy) ivy-re-builders-alist)))

(use-package avy
  :bind (:map dired-mode-map
              ("." . avy-goto-word-or-subword-1))
  :custom (avy-style 'de-bruijn)
  :chords
  ("jj" . avy-goto-char-timer)
  ("jk" . avy-goto-word-or-subword-1)
  ("jl" . avy-goto-line)
  :config (avy-setup-default))


(use-package ispell
  :straight nil
  :ensure-system-package (hunspell . "trizen -S hunspell")
  :custom
  (ispell-dictionary "en_US")
  (ispell-program-name (executable-find "hunspell"))
  (ispell-really-hunspell t)
  (ispell-silently-savep t))

(use-package magit
  :bind (("C-x g" . magit-status)
         ("C-x M-g" . magit-dispatch)
         ("C-c M-g" . magit-file-popup))
  :config
  (use-package git-commit
    :custom (git-commit-summary-max-length 50))

  (use-package git-gutter
    :commands (global-git-gutter-mode)
    :init (global-git-gutter-mode 1)))


(use-package projectile
  :custom
  (projectile-cache-file (djm/emacs-cache "projectile.cache"))
  (projectile-completion-system 'ivy)
  (projectile-enable-caching t)
  (projectile-known-projects-file (djm/emacs-cache "projectile-bookmarks.eld"))
  :config
  (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
  (projectile-mode 1))

(use-package vterm)
(use-package eterm-256color
  :hook (term-mode . eterm-256color-mode))

(use-package shell-pop
  :bind ("C-x t" . shell-pop)
  :custom
  (shell-pop-shell-type (quote ("ansi-term" "*ansi-term*" (lambda () (ansi-term shell-pop-term-shell)))))
  (shell-pop-term-shell (getenv "SHELL"))
  :config
  (shell-pop--set-shell-type 'shell-pop-shell-type shell-pop-shell-type))

(use-package flycheck
  :hook ((after-init . global-flycheck-mode)
         (prog-mode . flycheck-mode-on-safe))
  :commands (flycheck-list-errors
             flycheck-error-list-next-error
             flycheck-error-list-previous-error
             flycheck-error-list-goto-error)
  :custom
  (flycheck-emacs-lisp-load-path 'inherit)
  (flycheck-indication-mode 'right-fringe)
  (when (fboundp 'define-fringe-bitmap)
    (define-fringe-bitmap 'flycheck-fringe-bitmap-double-arrow
      [16 48 112 240 112 48 16] nil nil 'center))
  :config
  (use-package flycheck-posframe
    :hook (flycheck-mode . flycheck-posframe-mode)
    :config (add-to-list 'flycheck-posframe-inhibit-functions
                         #'(lambda () (bound-and-true-p company-backend))))
  (use-package flycheck-pos-tip
    :defines flycheck-pos-tip-timeout
    :hook (global-flycheck-mode . flycheck-pos-tip-mode)
    :config (setq flycheck-pos-tip-timeout 30))
  (use-package flycheck-popup-tip
    :hook (flycheck-mode . flycheck-popup-tip-mode)))

(use-package sh-script
  :ensure-system-package shfmt
  :mode ((rx (and (? ".") (or "bash" "zsh"))) . sh-mode)
  :custom
  (sh-indentation 2)
  (sh-basic-offset 2))

(use-package ess
  :init
  (progn
    (add-to-list 'safe-local-variable-values '(outline-minor-mode))
    (add-to-list 'safe-local-variable-values '(whitespace-style
                                               face tabs spaces
                                               trailing lines space-before-tab::space
                                               newline indentation::space empty
                                               space-after-tab::space space-mark
                                               tab-mark newline-mark))))
