editors/emacs.d/dotemacs.org
** Language Server Setup
#+begin_src emacs-lisp
  (use-package lsp-mode
    :hook ((python-mode . lsp-deferred)
           (sh-mode . lsp-deferred)
           (c-mode-common . lsp-deferred))
    :preface
    (defun config-lsp--setup-buffer ()
      (when (gethash "documentHighlightProvider" (lsp--server-capabilities))
        (highlight-thing-mode -1)))
    :custom
    (flymake-fringe-indicator-position 'right-fringe)
    (lsp-auto-guess-root t)
    (lsp-edoc-render-all nil)
    (lsp-prefer-fly-make nil)
    (lsp-session-file (djm/emacs-cache "lsp-session-v1"))
    (lsp-restart 'ignore)
    (lsp-enable-on-type-formatting nil)
    :config
    (progn
      (when (and lsp-auto-configure lsp-auto-require-clients)
        (require 'lsp-clients))

      (add-hook 'lsp-after-open-hook #'config-lsp--setup-buffer)
      (define-key lsp-mode-map (kbd "C-c SPC") #'lsp-execute-code-action)))

  (use-package dap-mode
    :hook ((lsp-mode . dap-mode)
           (lsp-mode . dap-ui-mode))
    :preface
    (defvar config-lsp--dap-cache-dir (djm/emacs-cache "dap"))
    :init
    (progn
      (f-mkdir config-lsp--dap-cache-dir)
      (setq dap-utils-extension-path (expand-file-name "extensions" config-lsp--dap-cache-dir)))
    :config
    (setq dap-breakpoints-file (expand-file-name "breakpoints" config-lsp--dap-cache-dir)))

  (use-package lsp-ui
    :preface
    (progn
      (defun config-lsp-toggle-ui-overlays (&optional should-enable)
        (interactive (list (not (bound-and-true-p lsp-ui-mode))))
        (cond
         (should-enable
          (lsp-ui-mode +1)
          (eldoc-mode -1))
         (t
          (lsp-ui-mode -1)
          (eldoc-mode +1))))

      (defun config-lsp-configure-ui ()
        (config-lsp-toggle-ui-overlays t)
        (lsp-ui-flycheck-enable t)))
    :init
    (progn
      (use-package lsp-ui-flycheck :straight nil)
      (with-eval-after-load 'lsp-mode
        (define-key lsp-mode-map (kbd "C-C u") #'config-lsp-toggle-ui-overlays)))
    :config
    (progn
      (add-hook 'lsp-after-open-hook #'config-lsp-configure-ui)
      (setq lsp-ui-sideline-enable t
            lsp-ui-sideline-show-code-actions nil
            lsp-ui-sideline-show-flycheck nil
            lsp-ui-doc-enable nil)
      (define-key lsp-ui-mode-map (kbd "C-c C-c") #'lsp-goto-type-definition)
      (define-key lsp-ui-mode-map (kbd "C-c i") #'lsp-goto-implementation)
      (define-key lsp-ui-mode-map [remap xref-find-definitions] #'lsp-ui-peek-find-definitions)
      (define-key lsp-ui-mode-map [remap xref-find-references] #'lsp-ui-peek-find-references)))
#+end_src

** Python

#+begin_src emacs-lisp
  (use-package python
    :hook (python-mode . config-python--init-python-mode)
    :preface
    (progn
      (autoload 'python-indent-dedent-line "python")
      (autoload 'python-shell-get-process "python")

      (defun config-python--init-python-mode ()
        (setq-local comment-inline-offset 2)
        (setq-local tab-width 4)
        (prettify-symbols-mode -1)
        (when (executable-find "ipython")
          (setq-local python-shell-interpreter "ipython")
          (setq-local python-shell-interpreter-args "--simple-promt -i")))

      (defun config-python-backspace ()
        (interactive)
        (if (equal (char-before) ?\s)
            (unless (python-indent-dedent-line)
              (backward-delete-char-untabify 1))
          (sp-backward-delete-char)))

      (defvar config-python-prev-source-buffer)

      (defun config-python-repl-switch-to-source ()
        (interactive)
        (-when-let (buf config-python-prev-source-buffer)
          (when (buffer-live-p buf)
            (pop-to-buffer buf))))

      (defun config-python-repl ()
        (interactive)
        (when (derived-mode-p 'python-mode)
          (setq config-python-prev-source-buffer (current-buffer)))
        (let ((shell-process
               (or (python-shell-get-process)
                   (with-demoted-errors "Error: %S"
                     (call-interactively #'run-python)
                     (python-shell-get-process)))))
          (unless shell-process
            (error "Failed to start python shell properly"))
          (pop-to-buffer (process-buffer shell-process))))
      :config
      (progn
        (setq python-indent-guess-indent-offset nil)
        (setq python-indent-offset 4)
        (setq python-fill-docstring-style 'django)

        (push "jupyter" python-shell-completion-native-disabled-interpreters)

        (define-key python-mode-map [remap python-indent-dedent-line-backspace] #'config-python-backspace)
        (define-key python-mode-map [remap python-shell-switch-to-shell] #'config-python-repl)
        (define-key inferior-python-mode-map (kbd "C-c C-z") #'config-python-repl-switch-to-source)

        (add-to-list 'display-buffer-alist
                     `(,(rx bos "*Python*" eos)
                       (display-buffer-reuse-window
                        display-buffer-at-bottom)
                       (reusable-frames . visible)
                       (slot . 0)
                       (window-height . 0.2))))))

  (use-package anaconda-mode
    :hook ((python-mode . anaconda-mode)
           (python-mode . anaconda-eldoc-mode)))

  (use-package py-yapf
    :hook (python-mode . python-auto-format-mode)
    :preface
    (progn
      (defvar python-auto-format-buffer t)

      (defun python-auto-format-maybe ()
        (when python-auto-format-buffer
          (py-yapf-buffer)))

      (define-minor-mode python-auto-format-mode
        nil nil nil nil
        (if python-auto-format-mode
            (add-hook 'before-save-hook 'python-auto-format-maybe nil t)
          (remove-hook 'before-save-hook 'python-auto-format-maybe t)))))
#+end_src


#+begin_src emac-lisp
  (use-package dashboard
    :init (dashboard-setup-startup-hook)
    :custom
    (dashboard-items '((recents . 5)
                       (projects . 5)
                       (bookmarks . 5)
                       (agenda . 5)))
    :config
    (set-face-bold 'dashboard-heading-face t))

  (use-package org
    :straight org-plus-contrib
    :hook (org-mode . visual-line-mode)
    :requires (org-capture org-protocol)
    :custom
    (org-todo-keywords '((sequence "TODO" "DOING" "|" "DONE BUT" "DONE")
                         (sequence "MAYBE" "CANCELED" "|")))
    :config
    (org-add-link-type "project" 'projectile-switch-project-by-name)
    (use-package org-habit-plus
      :straight (org-habit-plus :type git :host github
                                :repo "oddious/org-habit-plus")
      :custom
      (org-habit-scheduled-past-days org-scheduled-past-days))
    (use-package org-make-toc
      :straight (org-make-toc :type git :host github
                              :repo "alphapapa/org-make-toc")
      :init (org-make-toc-mode 1)))

  (provide 'init)
  ;;; init.el ends here
#+end_src
